Tekla.Structures.Model.RebarProperties
The RebarProperties class defines the default properties of the reinforcing bars in a Tekla.Structures.Model.RebarSet.

Tekla.Structures.Model.RebarProperties.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarProperties class.

Tekla.Structures.Model.RebarProperties.Size
Gets or sets the size of the reinforcement.

Tekla.Structures.Model.RebarProperties.Grade
Gets or sets the steel grade of the reinforcing bar.
The grade indicates the strength of the steel used in reinforcing bars.
It can also indicate other factors, such as the weldability or surface deformations of the bar.

Tekla.Structures.Model.RebarProperties.Name
Gets or sets the name of the reinforcement.

Tekla.Structures.Model.RebarProperties.Class
Gets or sets the class of the reinforcement. The class is used to group reinforcements.

Tekla.Structures.Model.RebarProperties.NumberingSeries
Gets or sets the numbering series of the reinforcement.

Tekla.Structures.Model.RebarProperties.BendingRadius
Gets or sets the bending radius of the reinforcement.

Tekla.Structures.Model.RebarProperties.Finish
Gets or sets the finish of the rebars.
(Finish is currently internal because it is not yet fully implemented).

Tekla.Structures.Model.RebarProperties.ToStruct(Tekla.Structures.ModelInternal.dotRebarProperties_t@)
The to struct.
p:
The p.

Tekla.Structures.Model.RebarProperties.FromStruct(Tekla.Structures.ModelInternal.dotRebarProperties_t@)
The from struct.
p:
The p.